Please review and approve this deployment.
**Branch/Commit:** refs/heads/main / 0ce785ab79e33c1f7a4d61c757055260406af42c
**Workflow run:** https://github.com/JohnMonteir0/eks-with-cilium/actions/runs/17557789074

**Plan (last ~500 lines):**
```
module.karpenter.data.aws_partition.current: Reading...
module.karpenter.data.aws_region.current: Reading...
data.aws_availability_zones.available: Reading...
module.karpenter_disabled.data.aws_region.current: Reading...
module.karpenter.data.aws_iam_policy_document.controller_assume_role[0]: Reading...
module.karpenter_disabled.data.aws_caller_identity.current: Reading...
module.karpenter_disabled.data.aws_partition.current: Reading...
data.aws_caller_identity.current: Reading...
aws_iam_service_linked_role.autoscaling: Refreshing state... [id=arn:aws:iam::911902230762:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0fd1aee0057baf792]
module.karpenter_disabled.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.karpenter.data.aws_partition.current: Read complete after 0s [id=aws]
module.karpenter.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.karpenter.data.aws_iam_policy_document.controller_assume_role[0]: Read complete after 0s [id=819195744]
module.karpenter_disabled.data.aws_partition.current: Read complete after 0s [id=aws]
module.karpenter.data.aws_caller_identity.current: Reading...
module.karpenter.aws_iam_role.controller[0]: Refreshing state... [id=KarpenterController-20250908153928756200000001]
module.karpenter.data.aws_iam_policy_document.node_assume_role[0]: Reading...
module.karpenter.data.aws_iam_policy_document.node_assume_role[0]: Read complete after 0s [id=2560088296]
data.aws_caller_identity.current: Read complete after 0s [id=911902230762]
module.karpenter_disabled.data.aws_caller_identity.current: Read complete after 1s [id=911902230762]
module.karpenter.data.aws_caller_identity.current: Read complete after 1s [id=911902230762]
module.eks_bottlerocket.data.aws_partition.current[0]: Reading...
module.eks_bottlerocket.data.aws_caller_identity.current[0]: Reading...
module.eks_bottlerocket.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks_bottlerocket.data.aws_partition.current[0]: Read complete after 0s [id=aws]
data.aws_availability_zones.available: Read complete after 1s [id=us-east-1]
module.eks_bottlerocket.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_partition.current: Reading...
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_caller_identity.current: Reading...
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks_bottlerocket.module.kms.data.aws_caller_identity.current[0]: Reading...
module.eks_bottlerocket.aws_iam_role.this[0]: Refreshing state... [id=cilium-cluster-20250908153929222500000002]
module.eks_bottlerocket.module.kms.data.aws_partition.current[0]: Reading...
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks_bottlerocket.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks_bottlerocket.data.aws_iam_policy_document.custom[0]: Reading...
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_role.this[0]: Refreshing state... [id=cilium-nodes]
module.eks_bottlerocket.data.aws_iam_policy_document.custom[0]: Read complete after 0s [id=513122117]
module.eks_bottlerocket.aws_iam_policy.custom[0]: Refreshing state... [id=arn:aws:iam::911902230762:policy/cilium-cluster-20250908153929231500000003]
module.eks_bottlerocket.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=911902230762]
module.eks_bottlerocket.data.aws_caller_identity.current[0]: Read complete after 0s [id=911902230762]
module.eks_bottlerocket.data.aws_iam_session_context.current[0]: Reading...
module.eks_bottlerocket.data.aws_iam_session_context.current[0]: Read complete after 0s [id=arn:aws:iam::911902230762:user/cloud_user]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_caller_identity.current: Read complete after 0s [id=911902230762]
module.eks_bottlerocket.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=cilium-cluster-20250908153929222500000002-20250908153929916400000009]
module.eks_bottlerocket.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=cilium-cluster-20250908153929222500000002-20250908153929782100000004]
module.eks_bottlerocket.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=cilium-cluster-20250908153929222500000002-20250908153929814100000005]
module.eks_bottlerocket.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks_bottlerocket.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2629419069]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=cilium-nodes-20250908153929846100000006]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=cilium-nodes-2025090815392996290000000a]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_role_policy_attachment.additional["AmazonSSMManagedInstanceCore"]: Refreshing state... [id=cilium-nodes-20250908153929914600000008]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=cilium-nodes-20250908153929858900000007]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_instance_profile.this[0]: Refreshing state... [id=cilium-nodes]
module.eks_bottlerocket.module.kms.aws_kms_key.this[0]: Refreshing state... [id=355f6e41-eed4-4147-9db4-308c68048151]
module.eks_bottlerocket.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/cilium]
module.eks_bottlerocket.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::911902230762:policy/cilium-cluster-ClusterEncryption20250908153959148700000011]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-04fd4a294e275f45b]
module.eks_bottlerocket.aws_security_group.cluster[0]: Refreshing state... [id=sg-0b179e80b8e98082b]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0134b792c06948723]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-070a444baeabd8191]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d0f856e655f35bcb]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-068597293d5af2855]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-042da6204023aade5]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0ce37bc07275bfb86]
module.eks_bottlerocket.aws_security_group.node[0]: Refreshing state... [id=sg-0b6ee98c2167715aa]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-013f4a60f48eccc40]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0f3433781c44148b0]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-011b5edfe1ea8fddd]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-078aac62deea09ebd]
module.vpc.aws_subnet.intra[1]: Refreshing state... [id=subnet-0f718fd77d9ffafe6]
module.vpc.aws_subnet.intra[2]: Refreshing state... [id=subnet-001e3493784de1301]
module.vpc.aws_subnet.intra[0]: Refreshing state... [id=subnet-0f18cd31f6812c477]
module.vpc.aws_route_table.intra[0]: Refreshing state... [id=rtb-0c134e50fc50479af]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0050e984b28022c6d]
module.eks_bottlerocket.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=cilium-cluster-20250908153929222500000002-20250908153959586900000012]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0e543f7796f6ed3ef]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-05c7a20f34af5771a]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-08fe08e2128ad0d05]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-03c0ff4f10294a072]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-1724182411]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-2512634575]
module.eks_bottlerocket.aws_security_group_rule.node["allow_icmp_from_vpc"]: Refreshing state... [id=sgrule-1207872929]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-3691844278]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-3509715618]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-1321328016]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-2884640092]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-3098288509]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-3264957540]
module.eks_bottlerocket.aws_security_group_rule.node["allow_all_from_vpc"]: Refreshing state... [id=sgrule-3042203018]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-1655864010]
module.eks_bottlerocket.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-1577748637]
module.eks_bottlerocket.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-2672885692]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0077ab9ee1176b3aa]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0cfeef0af650b1ecd]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0219b79e494271d65]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0050e984b28022c6d1080289494]
module.vpc.aws_route_table_association.intra[0]: Refreshing state... [id=rtbassoc-08fcc744d704cca04]
module.vpc.aws_route_table_association.intra[1]: Refreshing state... [id=rtbassoc-040a4d96f7ad4231c]
module.vpc.aws_route_table_association.intra[2]: Refreshing state... [id=rtbassoc-0e03abfcfe96ed02f]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-080236bde03d726f4]
module.eks_bottlerocket.aws_eks_cluster.this[0]: Refreshing state... [id=cilium]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-070a444baeabd81911080289494]
module.eks_bottlerocket.aws_ec2_tag.cluster_primary_security_group["GithubRepo"]: Refreshing state... [id=sg-0b97ca3ec3cd8aa1f,GithubRepo]
module.eks_bottlerocket.aws_ec2_tag.cluster_primary_security_group["Cluster"]: Refreshing state... [id=sg-0b97ca3ec3cd8aa1f,Cluster]
module.eks_bottlerocket.aws_ec2_tag.cluster_primary_security_group["GithubOrg"]: Refreshing state... [id=sg-0b97ca3ec3cd8aa1f,GithubOrg]
module.eks_bottlerocket.time_sleep.this[0]: Refreshing state... [id=2025-09-08T15:50:07Z]
module.eks_bottlerocket.aws_eks_access_entry.this["cluster_creator"]: Refreshing state... [id=cilium:arn:aws:iam::911902230762:user/cloud_user]
module.eks_bottlerocket.data.tls_certificate.this[0]: Reading...
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_eks_access_entry.this[0]: Refreshing state... [id=cilium:arn:aws:iam::911902230762:role/cilium-nodes]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_ssm_parameter.ami[0]: Reading...
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=2041667616558689121]
module.eks_bottlerocket.data.tls_certificate.this[0]: Read complete after 1s [id=922877a0975ad078a65b8ff11ebc47b8311945c7]
module.eks_bottlerocket.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::911902230762:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/21DEB01997325DFAB21D352DE8C2CAEE]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_ssm_parameter.ami[0]: Read complete after 1s [id=/aws/service/bottlerocket/aws-k8s-1.33/x86_64/latest/image_id]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_launch_template.this[0]: Refreshing state... [id=lt-0809005dfb8ffa3bf]
module.eks_bottlerocket.aws_eks_access_policy_association.this["cluster_creator_admin"]: Refreshing state... [id=cilium#arn:aws:iam::911902230762:user/cloud_user#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_autoscaling_group.this[0]: Refreshing state... [id=karpenter-20250908155013637200000021]
module.karpenter.aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/911902230762/Karpenter-cilium]
module.karpenter.aws_cloudwatch_event_rule.this["health_event"]: Refreshing state... [id=KarpenterHealthEvent-20250908154939076400000018]
aws_eks_addon.pod_identity_agent: Refreshing state... [id=cilium:eks-pod-identity-agent]
module.karpenter.aws_cloudwatch_event_rule.this["instance_rebalance"]: Refreshing state... [id=KarpenterInstanceRebalance-20250908154939074800000017]
module.karpenter.aws_eks_pod_identity_association.karpenter[0]: Refreshing state... [id=a-qgaqn7bfp5hzesrm6]
module.karpenter.aws_cloudwatch_event_rule.this["spot_interrupt"]: Refreshing state... [id=KarpenterSpotInterrupt-20250908154939070700000015]
module.karpenter.aws_cloudwatch_event_rule.this["instance_state_change"]: Refreshing state... [id=KarpenterInstanceStateChange-20250908154939065300000014]
module.karpenter.aws_iam_role.node[0]: Refreshing state... [id=cilium]
data.kubectl_file_documents.karpenter: Reading...
data.kubectl_file_documents.karpenter: Read complete after 0s [id=4140ad41ae80710ecda2f78b69fea5abb6cfe202ebad46fbf9d578bc281a9c36]
module.aws_auth.kubernetes_config_map.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
module.network.data.aws_caller_identity.current: Reading...
module.network.data.aws_caller_identity.current: Read complete after 0s [id=911902230762]
module.network.data.aws_eks_cluster_auth.this: Reading...
module.network.data.aws_eks_cluster_auth.this: Read complete after 0s [id=cilium]
module.network.data.aws_eks_cluster.this: Reading...
module.network.data.aws_eks_cluster.this: Read complete after 1s [id=cilium]
module.karpenter.aws_iam_role_policy_attachment.node_additional["AmazonSSMManagedInstanceCore"]: Refreshing state... [id=cilium-2025090815493985910000001c]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=cilium-2025090815493984160000001b]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=cilium-20250908154939560900000019]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEKS_CNI_Policy"]: Refreshing state... [id=cilium-2025090815493968780000001a]
module.network.helm_release.cilium: Refreshing state... [id=cilium]
module.karpenter.data.aws_iam_policy_document.queue[0]: Reading...
module.karpenter.data.aws_iam_policy_document.queue[0]: Read complete after 0s [id=2451579626]
module.karpenter.aws_sqs_queue_policy.this[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/911902230762/Karpenter-cilium]
module.karpenter.data.aws_iam_policy_document.v1[0]: Reading...
module.karpenter.data.aws_iam_policy_document.v033[0]: Reading...
module.karpenter.data.aws_iam_policy_document.v033[0]: Read complete after 0s [id=994916982]
module.karpenter.data.aws_iam_policy_document.v1[0]: Read complete after 0s [id=1424150802]
module.karpenter.data.aws_iam_policy_document.controller[0]: Reading...
module.karpenter.data.aws_iam_policy_document.controller[0]: Read complete after 0s [id=994916982]
module.karpenter.aws_iam_policy.controller[0]: Refreshing state... [id=arn:aws:iam::911902230762:policy/KarpenterController-2025090815500546340000001d]
module.karpenter.aws_eks_access_entry.node[0]: Refreshing state... [id=cilium:arn:aws:iam::911902230762:role/cilium]
module.karpenter.aws_cloudwatch_event_target.this["instance_rebalance"]: Refreshing state... [id=KarpenterInstanceRebalance-20250908154939074800000017-KarpenterInterruptionQueueTarget]
module.karpenter.aws_cloudwatch_event_target.this["instance_state_change"]: Refreshing state... [id=KarpenterInstanceStateChange-20250908154939065300000014-KarpenterInterruptionQueueTarget]
module.karpenter.aws_cloudwatch_event_target.this["spot_interrupt"]: Refreshing state... [id=KarpenterSpotInterrupt-20250908154939070700000015-KarpenterInterruptionQueueTarget]
module.karpenter.aws_cloudwatch_event_target.this["health_event"]: Refreshing state... [id=KarpenterHealthEvent-20250908154939076400000018-KarpenterInterruptionQueueTarget]
module.karpenter.aws_iam_role_policy_attachment.controller[0]: Refreshing state... [id=KarpenterController-20250908153928756200000001-2025090815500598630000001e]
module.aws_auth.kubernetes_config_map_v1_data.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
aws_eks_addon.coredns: Refreshing state... [id=cilium:coredns]
module.helm.data.aws_iam_policy_document.external_dns_policy: Reading...
module.helm.data.aws_caller_identity.current: Reading...
module.helm.data.aws_iam_policy_document.external_dns_policy: Read complete after 0s [id=2902363378]
module.helm.data.aws_subnets.public: Reading...
module.helm.data.aws_region.current: Reading...
module.helm.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.helm.aws_iam_policy.external_dns_policy: Refreshing state... [id=arn:aws:iam::911902230762:policy/eks-external-dns-policy]
module.helm.data.aws_iam_policy_document.lb_controller_policy: Reading...
module.helm.helm_release.external_dns: Refreshing state... [id=external-dns]
module.helm.helm_release.kube_prometheus_stack: Refreshing state... [id=kube-prometheus-stack]
module.helm.helm_release.karpenter: Refreshing state... [id=karpenter]
module.helm.data.aws_iam_policy_document.lb_controller_policy: Read complete after 0s [id=458242647]
module.helm.aws_iam_policy.load_balancer_controller_policy: Refreshing state... [id=arn:aws:iam::911902230762:policy/eks-load-balancer-controller-policy]
module.helm.data.aws_caller_identity.current: Read complete after 0s [id=911902230762]
module.helm.aws_iam_role.eks_load_balancer_controller: Refreshing state... [id=eks-load-balancer-controller-role]
module.helm.aws_iam_role.eks_ebs_csi_controller: Refreshing state... [id=ebs-csi-controller-role]
module.helm.aws_iam_role.eks_external_dns: Refreshing state... [id=eks-external-dns-role]
module.helm.data.aws_subnets.public: Read complete after 0s [id=us-east-1]
module.helm.aws_iam_role_policy_attachment.attach_external_dns_policy: Refreshing state... [id=eks-external-dns-role-20250908155229315300000023]
module.helm.kubernetes_service_account.external_dns: Refreshing state... [id=kube-system/external-dns]
module.helm.kubernetes_service_account.aws_load_balancer_controller: Refreshing state... [id=kube-system/aws-load-balancer-controller]
module.helm.aws_iam_role_policy_attachment.attach_load_balancer_policy: Refreshing state... [id=eks-load-balancer-controller-role-20250908155229467200000025]
module.helm.aws_iam_role_policy_attachment.attach_ebs_csi_policy: Refreshing state... [id=ebs-csi-controller-role-20250908155229349300000024]
module.helm.kubernetes_service_account.eks_ebs_csi_controller: Refreshing state... [id=kube-system/ebs-csi-controller-sa]
module.helm.helm_release.aws_load_balancer_controller: Refreshing state... [id=aws-load-balancer-controller]
module.helm.helm_release.ebs_csi_driver: Refreshing state... [id=aws-ebs-csi-driver]
module.helm.time_sleep.wait_alb_webhook: Refreshing state... [id=2025-09-08T16:15:37Z]
module.helm.helm_release.ingress-nginx: Refreshing state... [id=ingress-nginx]
module.helm.helm_release.argocd: Refreshing state... [id=argocd]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # kubectl_manifest.karpenter["/apis/karpenter.k8s.aws/v1/ec2nodeclasses/default"] will be created
  + resource "kubectl_manifest" "karpenter" {
      + api_version             = "karpenter.k8s.aws/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "EC2NodeClass"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "default"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: karpenter.k8s.aws/v1
            kind: EC2NodeClass
            metadata:
              name: default
            spec:
              amiSelectorTerms:
              - alias: bottlerocket@latest
              role: cilium
              securityGroupSelectorTerms:
              - tags:
                  karpenter.sh/discovery: cilium
              subnetSelectorTerms:
              - tags:
                  karpenter.sh/discovery: cilium
              tags:
                karpenter.sh/discovery: cilium
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.karpenter["/apis/karpenter.sh/v1/nodepools/default"] will be created
  + resource "kubectl_manifest" "karpenter" {
      + api_version             = "karpenter.sh/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "NodePool"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "default"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: karpenter.sh/v1
            kind: NodePool
            metadata:
              name: default
            spec:
              disruption:
                consolidateAfter: 30s
                consolidationPolicy: WhenEmpty
              limits:
                cpu: 5000
              template:
                spec:
                  nodeClassRef:
                    group: karpenter.k8s.aws
                    kind: EC2NodeClass
                    name: default
                  requirements:
                  - key: node.kubernetes.io/instance-type
                    operator: In
                    values:
                    - t3.medium
                    - t3.small
                  - key: karpenter.sh/capacity-type
                    operator: In
                    values:
                    - on-demand
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.helm.helm_release.argocd is tainted, so must be replaced
-/+ resource "helm_release" "argocd" {
      ~ id                         = "argocd" -> (known after apply)
      + manifest                   = (known after apply)
      ~ metadata                   = [
          - {
              - app_version    = "v2.9.3"
              - chart          = "argo-cd"
              - first_deployed = 1757348858
              - last_deployed  = 1757348858
              - name           = "argocd"
              - namespace      = "argocd"
              - notes          = <<-EOT
                    In order to access the server UI you have the following options:
                    
                    1. kubectl port-forward service/argocd-server -n argocd 8080:443
                    
                        and then open the browser on http://localhost:8080 and accept the certificate
                    
                    2. enable ingress in the values file \`server.ingress.enabled\` and either
                          - Add the annotation for ssl passthrough: https://argo-cd.readthedocs.io/en/stable/operator-manual/ingress/#option-1-ssl-passthrough
                          - Set the \`configs.params."server.insecure"\` in the values file and terminate SSL at your ingress: https://argo-cd.readthedocs.io/en/stable/operator-manual/ingress/#option-2-multiple-ingress-objects-and-hosts
                    
                    
                    After reaching the UI the first time you can login with username: admin and the random password generated during the installation. You can find the password by running:
                    
                    kubectl -n argocd get secret argocd-initial-admin-secret -o jsonpath="{.data.password}" | base64 -d
                    
                    (You should delete the initial secret afterwards as suggested by the Getting Started Guide: https://argo-cd.readthedocs.io/en/stable/getting_started/#4-login-using-the-cli)
                EOT
              - revision       = 1
              - values         = jsonencode(
                    {
                      - configs = {
                          - params = {
                              - "server.insecure" = true
                            }
                        }
                      - global  = {
                          - domain = "argocd.911902230762.realhandsonlabs.net"
                        }
                      - server  = {
                          - ingress = {
                              - annotations      = {
                                  - "external-dns.alpha.kubernetes.io/hostname"      = "argocd.911902230762.realhandsonlabs.net"
                                  - "nginx.ingress.kubernetes.io/backend-protocol"   = "HTTP"
                                  - "nginx.ingress.kubernetes.io/force-ssl-redirect" = "true"
                                }
                              - enabled          = true
                              - extraTls         = [
                                  - {
                                      - hosts = [
                                          - "argocd.911902230762.realhandsonlabs.net",
                                        ]
                                    },
                                ]
                              - ingressClassName = "nginx"
                            }
                        }
                    }
                )
              - version        = "5.51.6"
            },
        ] -> (known after apply)
        name                       = "argocd"
      ~ status                     = "failed" -> "deployed"
        # (26 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```
